Repository: jouissancetka/LMW
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 照理说他应该把这批灵草拍下来的，可他就觉得不太好，为什么不好他却说不出来，就是一种感觉。
en_us: Based on that, he should bid on these magic herbs but it just didn't feel right, and he couldn't explain why either, just a guts feeling.

source: 熊笑毕恭毕敬的对傅苍穹拱手道：“师尊，凌默的朋友回来了。”
en_us: Xiong Xiao respectfully bowed, placing his hands together, and said, "Ling Mo's friend has returned."

source: 熙熙攘攘的街道上，凌霄手提着一块传音石，听着吵闹的声音不间断的传过来，嘴角蓦然弯起一丝浅浅的弧度，竟然还笑得出来，看来某人的危机感不够强啊。
en_us: On a bustling street, Ling Xiao was holding a transmission stone as he listened to the rowdy sounds that were unceasingly transmitted over. The corner of his mouth suddenly curled up in a slight curve. To be able to laugh even at this point, it seemed that someone’s sense of crisis is not strong enough ah.

source: 熟悉的建筑就在眼前。
en_us: The familar structure was right in front of them.

source: 爱的是其他人都没能享受到这项殊荣，他是唯一一个被大人赏赐名字的人，恨的是，名字真难听！
en_us: He loved it because that no one else had enjoyed this honor of being the only one who has been bestowed a name by the Boss. He hated it because the name was awful!

source: 片刻后，一道悠闲漫步的身影出现在空中，就这样缓慢的走了过来，登上绵绵山还敢如此嚣张，也就只有游震天一人。
en_us: After a moment, a figure walking leisurely appeared in the air, and slowly walked over. You ZhenTian was the only person who would climb over the continuous mountain (绵绵山) and still dare to be so arrogant.

source: 片刻后，小岛再度散发出第二道气息，这道比上一道更具诱惑，蕴含着浓郁至极的精纯灵力，只是闻一闻就能感觉得到体内停滞的修为隐隐有要突破的迹象。
en_us: After a moment, the scent spread from the small island for the second time. This time, it was even more temping than the last, and it contained an extremely rich and pure spiritual energy. Just smelling it made them feel as if the cultivation that had stagnated in their bodies would suddenly break through.

source: 片刻后，掌柜找了借口进去将用完的盘子拿了出来，顺便看了下里面有没有异样的情况。
en_us: After a moment, the concierge used the excuse of retrieving the empty plates to enter the room, and along the way he glanced around to see if there was anything unusual happening.

source: 片刻后，那些潜藏在鬼冢山脉的妖兽和人类修炼者一个接一个的出现在现场附近，搜索的灵识也没有间断，当他们‘看到’凌霄制造的状况后，个个倒吸了一口气。
en_us: After a moment, those demon beasts and human practitioners that were hiding in the Ghost Tomb Mountain Ranges appeared near the scene one after another. Their searching spiritual insight/consciousness (搜索的灵识) was uninterrupted. When they 'saw' the scene created by Ling Xiao, each and every one gasped.

source: 片该后，侍卫把人带了进来。
en_us: After a while, the housecarl escorted the man inside.

source: 牛徐阳捕捉到他脸上那丝不自然，立刻接话道：“莫菲，你谢大哥是认为我们实力太弱，不是那两人的对手，所以才会在这里等他们打完离开。”
en_us: Niu XuYang caught the flash of discomfort on his face and immediately said, "Mo Fei, your Xie Dage thinks we're too weak and not a match for the two, so that's why he's planning on waiting for the two to finish fighting before heading over."

source: 牛徐阳不是很情愿，但是迫于两姐妹的压力，他不得不硬着头皮挡在男人面前，违心说出邀请的话，所以游小默猜的没错，他们就是冲着凌霄的长相来的。
en_us: Niu XuYang wasn't very willing but pressured by the sisters, he could only brace himself and invite them. So what You XiaoMo had guessed was true, they were after Ling Xiao's looks.

source: 牛徐阳亦没想到会是他们，他知道莫雪和莫菲不喜欢他，但是与其让莫雪对谢俊献殷勤，他宁愿这个人是游小默，至少莫雪绝对不会对他有好感，因为他长得不符合莫雪的标准。
en_us: Niu XuYang did not think it would be them. He knew that Mo Xue and Mo Fei did not like him. However, rather than letting Mo Xue fawn upon Xie Jun, he would rather that person being fawned over to be You XiaoMo. At the very least, Mo Xue would never have a favorable impression of him because his looks did not meet Mo Xue's standards.

source: 牛徐阳大惊失色，没想到他们说动手就动手，正要冲过去，强盗头子突然挡在他面前。
en_us: Niu XuYang turned pale with fright. He hadn't imagined that they would act as soon as they said so, and he was about to rush over when the bandit chief abruptly blocked his path.

source: 牛徐阳心里有些同情莫雪，如果是在进洞城之前，他一定会不顾一切扑过去救莫雪，可是现在，她那些冷嘲热讽，以及与谢俊时刻亲密的举动已经磨掉他对她的耐心和爱意。
en_us: Somewhere in him. Niu XuYang felt a little bad for Mo Xue. If this was before they had entered Dong Yu, then he would have stopped at nothing to save her. But now, with her cynicism and her intimate actions with Xie Jun, she had wear off any love he had for her.

source: 牛徐阳心里顿时颇不是滋味，这个男人长得也太好看了，要是莫雪喜欢上他，他怎么办？
en_us: Niu XuYang felt complicated, the man was too handsome, if Mo Xue fell in love with him, what was he going to do?

source: 牛徐阳急得眼睛都红了，他想冲过去救莫雪，但是强盗头子突然朝他攻过来，招招致命，致使他分不出手。
en_us: Niu XuYang was so worried that his eyes turned red. He wanted to charge over and rescue Mo Xue, but the bandit chief abruptly launched an attack towards him. It was a deadly blow, causing him to be unable to go over.

source: 牛徐阳恭恭敬敬的走过来，一扫脸上的冷漠之色。
en_us: Niu XuYang walked respectfully over, sweeping away the detachment from his face.

source: 牛徐阳愣了一下，立刻露出一脸失望的表情，心里实际上正松了一口气，这样他就不需要担心了。
en_us: Niu XuYang paused for a moment before showing an expression of disappointment, but inside, he breathe a sigh of relief. This way, he wouldn't have to worry anymore.

source: 牛徐阳眉头皱成一个川字，“莫雪，其实救你的人根本不是他，而是另有其人。”
en_us: Niu XuYang frowned. His eyebrows formed a into a '川' character, "Mo Xue, actually, the one who saved you is not him, but another person."

source: 牛徐阳看出她动摇了，立刻指着游小默和凌霄藏身的方向，大声说道：“我亲眼看到的，就是那个地方，他们应该藏在石头后面。”
en_us: Niu XuYang saw that she was wavering and immediately pointed in the direction of You XiaoMo and Ling Xiao as he cried out, "I saw it with my own eyes. The fruit pit came from there. They should be hiding behind the stone."

source: 牛徐阳看到莫雪落入他们手中，心中一急，难免就出错了，不小心被强盗头子一拳击中胸口，吐血摔了出去，五脏六腑差点移位了。
en_us: When Niu XuYang saw Mo Xue fall into their hands, his heart jumped, and it was hard to avoid making a mistake. He accidentally let the bandit chief strike him in the chest, and he spat out blood as he went flying, his internal organs almost displaced.

source: 牛徐阳看得眼睛都充血了，犹如一头发疯的蛮牛。
en_us: Niu XuYang's eyes were red as he watched, and he seemed like a crazed bull.

source: 牛徐阳瞥了眼脸上越来越难看的谢俊，冷笑一声不再说话。
en_us: Niu XuYang glanced at Xie Jun, whose expression was growing uglier by the second, and scoffed before shutting up.

source: 牛徐阳立刻戒备起来。
en_us: Niu XuYang instantly went on alert.

source: 牛徐阳耐着性子重挑，结果不是莫雪挑剔就是莫菲挑剔，什么稀奇古怪的理由都说得出来，到现在已经过去一个多时辰，他们连一个队友都没邀请到。
en_us: Niu XuYang patiently kept picking but they were either rejected by Mo Fei or Mo Xue, using all kinds of weird reasons too. Now that an hour has passed, they haven't even gotten one teammate.

source: 牛徐阳脸色复杂的看着气得脸都扭曲起来的莫雪，本来他是挺喜欢莫雪这种直爽的性格，但是现在他又不确定了，对他和莫菲来说，真正救他们的确实是谢俊，但是对莫雪而言，她更应该感谢游小默才对。
en_us: Niu XuYang looked at Mo Xue, whose face was twisted with anger, with a complicated expression. Originally, he quite liked Mo Xue's outspoken character, but now he was unsure. For him and Mo Fei, it was Xie Jun who really saved them. But for Mo Xue, the one she should be more grateful to was You XiaoMo.

source: 牛徐阳说：“二位应该是第一次来洞域吧，初次到这里的人都不清楚，洞域的情况很危险，那些强盗很多都有帝境的修为，人数多在四五个左右，如果不与人结伴同行，他们十之八九会盯上你们的。”
en_us: Niu XuYang continued, "This should be the first time for you guys right? First-timers usually don't know this, but the situation inside Dong Yu is very dangerous. Many of those bandits are of the Emperor Realm, at least four or five of them. If you don't join a team, they're very likely to pick on you."

source: 犀利修长的腿旋风般的扫向斗篷人背后大开的门户，后者没料到他会突然攻击，或者说他错估了凌霄的实力。
en_us: His slender and incisive (犀利) legs swept towards the back of the cloaked man like a whirlwind. The latter had not expected him to attack suddenly, or maybe he had misjudged Ling Xiao's strength.

source: 犹豫了一会，滕梓心放在炉鼎前的手一翻，一样东西出现在她手心里，如果游小默有看到的话，一定会认出这个东西来，因为它就是那小半瓶灵水。
en_us: After a bit of hesitation, Teng ZiXin turned her hand and something appeared in her palm. If You XiaoMo had seen this, he would’ve recognized it instantly because that something was his half a vial of spiritual water.

source: 狂暴的空间之力切割着莫雪的血肉，鲜血‘噗嗤噗嗤’的往外喷，不到一分钟，整个人就变成一个血人，脆弱的肢体面对空间之力就像一块豆腐，半截手臂，腿部，半刻脑袋等等，画面极其恐怖。
en_us: The violent spacial force cut through Mo Xue's flesh, blood gushing out. In under a minute, she had become nothing more than bits of gore and blood, the spacial force cutting through her like a hot knife through butter. Half an arm, a leg, half a head, and so on. The entire scene was horrifying.

source: 狗腿子伙计仗着有老板娘撑腰，经常作威作福，倒也是个不知死活的人。
en_us: The sucker up server, with the owner to back him up, often acted bigger than he was, arrogant and unafraid.

source: 狗腿道：“那还用得着说嘛，您的对手一个个穿的衣服穷酸样，他们哪能更您比，你可是双鱼楼的张少，谁的家底还能比你丰厚。”
en_us: The sycophant said, "It's obvious. All your rivals are dressed so poorly, how could they compare to you? You're the young master Zhang of ShuangYu Hotel. Who's background is as wealthy as yours?"

source: 独眼刀疤已经反应过来，眼睛充血般愤怒地盯着游小默，他虽然没了武器，但他也不是吃素的。
en_us: One-Eyed Scarface had finally came back to himself, glaring at You XiaoMo red-eyed. He might've lost his weapon, but he was no weakling.

source: 独眼刀疤心中一凛，还未来得及做出反应，脑袋突然传来一阵钻心般的痛楚，惨叫声骤然响起。
en_us: One-Eyed Scarface's heart skipped a beat. Before he could react, a soul-wrenching pain erupted from his head, and he screamed out.

source: 独眼刀疤狠狠的跳起来，看着游小默的眼睛充满了怒火，竟然如此戏耍他，不可原谅！
en_us: One-Eyed Scarface swiftly jumped, rage filling his eyes. How dare he taunt him like that? Unforgivable!

source: 独立空间一直都是可遇不可求的东西，整个通天大陆拥有独立空间的人数一只手都能数得出来。
en_us: An independent dimension was something you could find but never bought (可遇不可求). Even in the TongTian Continent, you could count with one hand the amount of people who owned one.

source: 独立空间她也想得到，但是她更乐意当一只黄雀。
en_us: She also wanted the independent dimension, but she'd rather be the last one standing.

source: 独立空间比大神通者劈开的芥子空间更好，首先独立空间会随着它的主人的修为增长而升级，不仅具有强大的防御性能和隐匿性，而且在遇到危险时还会自动护主，与游小默的空间有异曲同工之妙。
en_us: An independent dimension was much better than a pocket dimension created by a powerhouse. First of all, an independent dimension could grow along with it's owner. Second, it has a strong defense, as well as create concealment. Most importantly, it could automatically protect it's owner in times of need, similar to You XiaoMo's dimension.

source: 独立空间漂浮在水中，变回原型后，它便慢慢的落向海底，那一片混浊之中，眼看着就要消失在他视线里。
en_us: The independent dimension was floating around, but once it returned to it's original form, it slowly sunk into the ocean, in to the abyss, about to disappear.

source: 猛虎吞下光团的下一秒就发出一道凄厉的怒咆声，虚幻的身体扭曲起来，仿佛随时都会崩溃一样。
en_us: The fierce tiger let out a wrathful and mournful roar the next second after it swallowed the light ball. Its illusory body warped, appearing as if it would crumble at any moment.

source: 猛虎的体积就像一座大山，高大凶猛，仿佛随时都会冲过来一样，再看凌霄，在他往后退了两步时，游小默看到在他面前的光团之中有四股力量在相互交缠着，不知道是不是因为力量相互排斥，碰撞得非常激烈。
en_us: The size of the fierce tiger was akin to a mountain. It was tall and ferocious as if it would rush over at any time. You XiaoMo looked at Ling Xiao and when he took two steps back, he saw the light ball in front of Ling Xiao had four forces intertwined with each other. Maybe because the forces were mutually rejecting (相互排斥) each other, the impact when they collided was extremely violent.

source: 猛虎诀是游震天修炼的一种顶级技法，是一种持续攻击手段，不论是想速战速决，还是拉锯战都可以，而且攻击力十分强大，所以才能成为他的成名招式。
en_us: The Fierce Tiger Secret Art (猛虎诀) was a transcendent level skill training technique that You ZhenTian cultivated. It was a continuous attack technique and could be applied whether one wanted a blitzkrieg strategy or a drawn-out battle (拉锯战). Its attack power was very strong so it became the technique he was known for (成名招式).

source: 猩猩是一种高阶妖兽，防御力和攻击力都非常强悍，可以说是一种打不死的小强，因此游小默那一脚对他的影响并不大。
en_us: Gorillas were a high grade demon beast, with great offensive and defensive capabilities. One could say that they were like a cockroach, un-killable. Thus, that kick You XiaoMo did, didn't effect him much.

source: 猩猩猛捶胸口几下，仰天发出一道咆哮声，然后朝游小默迅速的奔跑过去。
en_us: Pounding on his chest, the gorilla let out a roar and quickly ran towards You XiaoMo.

source: 猫球冲凌霄喊道：“喵呜喵呜喵呜……”
en_us: CatQiu began to meow furiously at Ling Xiao: “Meorrow mewl meow meow meow…”

source: 猫球看了自家主人一眼，接着又叫了几声。
en_us: CatQiu glanced back at his owner and gave a few more meows.

source: 猫球耷拉着耳朵，水汪汪的两只猫瞳委屈地回望他，它明明说的是实话。
en_us: CatQiu flattened its ears against its head, looking at him balefully with tearful eyes. All it did was tell the truth.

source: 猫球：“喵呜？”针眼是什么？
en_us: CatQiu: “Meow?” What’s sty?

source: 猫球：“喵呜～”
en_us: CatQiu: “Meow~”

source: 玄威猛然瞪大眼睛，“那只小乌龟果然在你们那里？
en_us: XuanWei's eyes widened. "So you really had that baby turtle?"

source: 玄威企图用玄龟族恐吓凌霄，就算他是玄龟族的叛徒，也只能交给玄龟族去处置，而且比起死在凌霄手里，他宁愿落入玄龟族手里，至少他不会死，玄龟族对待族人还是很宽容的。
en_us: XuanWei wanted to scare Ling Xiao using the Black Turtle Clan. Even though he was traitor to the clan, only the clan could deal with him. Plus, he's rather fall into the hands of the Black Turtle Clan than die at Ling Xiao's hands/ At the very least, he wouldn't be killed. The Black Turtle Clan was very lenient towards their fellow clanmates.

source: 玄威张着嘴吐出一口血，表情已经完全绝望了。
en_us: XuanWei spat blood, his expression sinking into complete despair.

source: 玄威心底浮起挥之不去的恐惧，突然愤怒的大吼，体内的灵力翻滚着奔涌而出，三百六十度毫无死角的攻击。
en_us: Fear clung to XuanWei's heart, and he suddenly roared with rage, the soul power inside him gushing out like a flood, attacking 360 degrees around him, not missing a single angle.

source: 玄威惊得寒毛都要立起来了，他不是害怕鬼，而是凌霄竟然能无声无息的出现在他身后，怎么能不让他感到震惊！
en_us: XuanWei's hair stood up on end from shock. He wasn't afraid of ghosts, but the fact that Ling Xiao could appear silently behind him, how can he not be shocked!

source: 玄威惊惧的大吼起来，他从来没想到自己会死在这里。
en_us: XuanWei yelled in fear. He had never thought he would die here.

source: 玄威的身体抽搐了一下就僵硬了，生机也在一瞬间流失了。
en_us: XuanWei's body twitched before going still, his life seeping away.

source: 玄威眼中聚然爆发出一道求生的光芒。
en_us: A shimmer of desire for survival erupted in Xuan Wei's gaze.

source: 玄威瞳孔一缩，当初他们小心翼翼的跑出来，担心被族中的长老知道，还做了很多掩护的工作，结果竟然是在为自己的死做掩护？
en_us: XuanWei's pupils shrank. Originally, they had been ever so careful in coming over here, afraid that the elders of the clan would find out. They even made a lot of efforts to cover themselves. Who would've thought that they were working to cover up their own death?

source: 玄威瞳孔瞪大到极致，最后看到的一幕是男人举起他的手，掌心处突然冒出一道紫色火焰，毫不犹豫的落在他的脑袋上。
en_us: XuanWei's eyes went as wide as they could go, and the last thing he saw was the man raising his hand, a purple flame appearing from the center of his palm and landing on his head without hesitation.

source: 玄威脑海里一瞬间闪过这个念头，与此同时，他下手亦毫不含糊，几乎想也不想就直接往身后发出攻击，不过又再次落空了。
en_us: That thought flashed through XuanWei's head, yet at the same time, he struck without without hesitation, not even thinking as he ent an attack behind him. However, it missed.

source: 玄宗不愿承认他的曾孙子是因为要离开这个人类才会有这种反常的行为，连忙劝告道：“小乐，我是你曾祖父，你快出来看看曾祖父……”
en_us: Xuan Zong wasn't willing to admit that his great-grandson was exhibiting this strange behavior because he didn't want to leave this human, so he hastily urged, "Little Le, (小乐 // Le or Yue?) I'm your great-grandfather. Hurry and come out to see your great-grandfather..."

source: 玄宗使尽浑身解数都说服不了他的曾孙子，只好照玄明说的把小乌龟交给他，眼中闪着一丝不情愿的挣扎，他的曾孙子竟然要靠外人来哄，他想想就觉得很不是滋味。
en_us: Xuan Zong gave it his all but was still unable to persuade his great-grandson, and he could only do as Xuan Ming said and hand over the baby turtle. There was a clearly unwilling struggle in his eyes. He actually had to depend on an outsider to coax out his great-grandson, and it left a very bad taste just thinking about it.

source: 玄宗表情很复杂，他的曾孙子不跟他这个曾祖父亲，竟然跟一个外人亲，而且还被他一句话就说服了，老人心里严重不平衡了，只说一声就带着他的曾孙子离开了客栈，后续事情都交给玄明处理。
en_us: Xuan Zong's expression was extremely complicated. His great-grandson refused to be intimate with him, his great-grandfather, but he was intimate with an outsider instead. Plus, he was persuaded with just one sentence, and the old man's heart was greatly unsettled. He only said one more thing before leaving the inn with his great-grandson and leaving everything else to Xuan Ming to take care of.

source: 玄宗颤颤的接过手，不过当他看到小乌龟的模样时，表情不由得僵住了，这真是他的曾孙子？
en_us: Xuan Zong trembled as he received him, but when he saw what the baby turtle looked like, his expression froze involuntarily. Was this actually his great-grandson?

source: 玄明一本正经的说道：“这次承二位的情，来日若有什么困难，二位尽管来找我们，玄龟族十分欢迎二位。”
en_us: Xuan Ming said seriously, "This time we are much obliged to the two of you. If you ever encounter any difficulties, may the two of you feel free to come find us. The Black Turtle Clan fully welcomes the two of you."

source: 玄明也不拐弯抹角，直接说道：“你们的身份已经被赤血家族拆穿了，现在，赤血家族正打着叛徒的名义想要把游兄弟抓回去，他们甚至找到逍遥院，眼下各方势力都还没有表态。”
en_us: Xuan Ming didn't talk in a roundabout way and got straight to the point. "Your identities have already been exposed by the Vermillion Blood Clan. Right now, the Vermillion Blood Clan is using the title of 'traitor' in order to drag Fellow Brother You back. They've even found the XiaoYao Institution, and as of now the power of all parties involved is still unclear."

source: 玄明建议道，赤血家族的实力想要伸进西境几乎是不可能的，不过他不认为两人会一直躲在西境，胆敢阴赤血家族那么多次，绝对不会因为被游震天发现就退缩。
en_us: Xuan Ming's suggestion was the Vermillion Blood Clan most likely wouldn't be able to extend its reach into Xi Jing. But he didn't believe that the two of them would hide in Xi Jing. Since they had dared to provoke the Vermillion Blood Clan so many times already, they definitely wouldn't cower just because they might be discovered by You ZhenTian.

source: 玄明抿唇一笑，小乌龟是不是玄龟族的后代其实一看就知道，同意血脉的族人是有感应的，只是让他意外的人，他们竟然给小乌龟涂颜色，不过这样确实比较保险。
en_us: Xuan Ming smiled tightly. Actually, he could tell with one glance whether the baby turtle was part of the Black Turtle Clan or not. Clan members of the same bloodline had an instinctive response, and it was just that he hadn't expected that they would actually paint over the baby turtle. However, this way was indeed safer.

source: 玄明摇摇头，玄龟族对外界的事情向来不是很关心，所以具体情况他也不清楚。
en_us: Xuan Ming shook his head. The Black Turtle Clan had never really cared about the outside world's affairs, so he was also unfamiliar with the specifics of the situation.

source: 玄明看向游小默解释道：“小乌龟的名字叫玄乐。”
en_us: Xuan Ming looked at You XiaoMo and explained, "The baby turtle's name is Xuan Le." (玄乐)

source: 玄明离开之前还把莫景的话转告给他们。
en_us: Before leaving, Xuan Ming also passed on Mo Jing's message for them.

source: 玄明笑了笑，没有否认，其实就算没有莫景三天前恰巧传来的消息，他也能猜到他们就是游小哈和凌默，不过仙子阿应该称呼他们为游小默和凌霄，因为外面现在正传的沸沸扬扬，偏偏两位当事人恰巧都不在，再看他们二人，形象很符合。
en_us: Xuan Ming laughed a bit and didn't deny it. Actually, even without the news that Mo Jing had sent over by chance three days before, he would still have guessed that they were You XiaoHa and Ling Mo, but they should be called You XiaoMo and Ling Xiao instead. Because there were rumors currently flying wildly around outside right now, and the only two parties involved were coincidentally absent, their images fit too well if someone looked at the two of them.

source: 玄明虽然像个满郎中，但是内力却透着一股精明，绝对不是个会瞧不起他人的人，难怪一个能成为玄龟族的代表，一个却默默无闻，看来即便是一家人，性格之差亦有天南地北。
en_us: Although Xuan Ming was like a (满郎中), he has a hidden shrewdness and was definitely not a person who would look down on others. No wonder one could be a representative of the Black Turtle Clan whilst the other was obscure and unknown. It seemed that their characters were poles apart even if they were from the same clan.

source: 玄明还是给游小默一种慢性子的感觉，尽管他这次没有掐着点过来，大概有同伴和他一起，不过玄明没有认出他们。
en_us: Xuan Ming still felt like a slowpoke (慢性子) to You XiaoMo. Even though he hadn't crept over this time (掐着点过来?), most likely because he was with his companions, he didn't recognize them.

source: 玄明迟疑了一下，点点头。
en_us: Xuan Ming hesitated for a moment before nodding.

source: 玄泽不置一词，面上却更加不屑。
en_us: Though Xuan Ze did not utter a single word, his expression showed even more disdain.

source: 玄泽发出一道愤怒的惨叫声。
en_us: Xuan Ze let out an angry cry of pain.

source: 玄泽只觉得脑袋一阵阵钝痛，令他无法思考，不断前进的巨大身体终于在一片不知名的海底停了下来。
en_us: All Xuan Ze was felt was a dull pain coming from his head, stopping him from thinking and finally, the continuously moving body of his, stopped at unknown waters.

source: 玄泽或许该庆幸，如果是人形，游小默的拳头绝对能把他的脑浆砸出来。
en_us: Maybe Xuan Ze should be glad that he wasn't in his human form, because if he was, You XiaoMo's fist would have definietly knock his brain out of his head. (脑浆)

source: 玄泽放下这句话，转身就往海上飞去。
en_us: Once Xuan Ze spat this sentence out, he turned to fly out to sea.

source: 玄泽现出本体后，身体十分巨大，海水几乎暴涨了两三米，小港口可能已经被海水淹没了，至于其他港口，因为地势比较高，所以情况应该不会很严重。
en_us: After Xuan Ze took on his original form, his size grew to immense proportions and the sea level rose by a sudden two or three meters. The small port was probably flooded by now. As for other ports, they were at a higher sea level, so it probably wasn't as bad for them.

source: 玄泽的摸样非常惨，被他砸得七窍都流血，他的眼睛睁不开，正是金翅虫的杰作，脖子处被吞金兽咬伤的地方则不断的涌出鲜血，引来不少闻腥而来的妖兽，不过他们只敢在远处观望。
en_us: Xuan Ze looked tragic. His whole face was bleeding (七窍都流血), his eyes couldn't open due to the handiwork of the Golden Winged Insects and the wound on his neck, bitten by the Metal Swallowing Beast, was gushing out blood. All the blood attracted many demon beasts to gather but they only dared to watch from afar.

source: 玄泽立刻停止晃动脑袋，身体快速的游出去，在辽阔的海域中嬉戏一样翻滚起来。
en_us: Xuan Ze immediately stopped thrashing his head and quickly swam forth, trashing about in the vast ocean space.

source: 玄泽第一时间就发现了，脑袋立刻剧烈的晃动起来，想要把他晃下去，海水也跟着翻滚起来。
en_us: Xuan Ze immediately noticed and started thrashing his head about, wanting to throw the other off. The sea also started to (海水也跟着翻滚起来).

source: 玄泽要的也是这个结果，他比游小默还担心凌霄会插手。
en_us: Xuan Ze also wanted this outcome. He was more worried than You XiaoMo that Ling Xiao would interfere.

source: 玄盛急忙叫住他们，不仅如此，他还跑到他们面前将他们拦下来。
en_us: Xuan Sheng hurriedly called out to them. Not only did he do that, he also ran to them and blocked their path.

source: 玄盛摸着花白的胡子，皮笑肉不笑的道：“老夫只是想问问，公子确定莫景是在刍云山脉？”
en_us: Xuan Sheng stroked his grizzled beard and put on an insincere smile, "This old man just wanted to ask, is Sir (公子) certain that Mo Jing is at the ChuYun Mountain Range?"

source: 玄盛显然也知道这件事，他的话反而让游小默怀疑，说不定他们和邢七是一伙的。
en_us: Xuan Sheng obviously knew this too, but his words made You XiaoMo suspect that maybe Xing Qi and them were in cahoots.

source: 玄盛看到他的模样不禁沉下脸，入魔者的战斗力虽然会翻倍增长，但是后果他亦十分了解。
en_us: Xuan Sheng's expression could not help darkening when he saw Xuan Ze's appearance. Although the fighting strength of devil-path cultivators would double, he knew the consequences very well.

source: 玄盛眼中透出一丝晦暗的喜色，“老夫从龙老那里听说了，是灵龟族的莫景找你们来的，说是有话要传达与我们，不知是何事？”
en_us: A trace of dark joy (晦暗的喜色) was revealed in Xuan Sheng's eyes, "This old man heard from Old Long (龙老) that it was Mo Jing from the Mystic Tortoise Clan who asked you to come. He said that there was something you had to convey to us. May I know what the matter is?"

source: 玄盛眼中闪过一丝异样，似乎被年轻男子的话动摇了，但也仅仅一瞬间，声音便冷厉下来，警告道：“阿泽，你忘了我们玄龟族的规矩吗，怎么可以对帮助我们的恩人说这种话！”
en_us: A peculiar glint flashed through Xuan Sheng's eyes and he seemed to be swayed by the young man's words. However, it was only for a moment. Then his tone chilled as he warned, "Ah Ze (阿泽), have you forgotten the rules of our Black Turtle Clan? How can you say such words to the benefactor who helped us?!"

source: 玄盛眼神一历，神色有些阴晴不定，却没有第一时间反驳他的话，这一犹豫反而坐实了凌霄的话是对的。
en_us: Even though Xuan Sheng's expression was obscure, he did not immediately refute Ling Xiao's words. This hesitation confirmed the truth of Ling Xiao's words.

source: 玄盛脸一沉，阴森森的说道：“看来无路如何也不能放过你们，你们知道得太多了，只有死了我才能安心。”
en_us: Xuan Sheng's expression darkened as he sinisterly admitted, "It seems that I cannot let you go no matter what happens. You both know too much. I'll only feel at ease if you're dead."

source: 玄盛虽然知道莫景遇险的事情，但是他并不知道救走莫景的人就是凌霄和游小默。
en_us: Although Xuan Sheng knew that Mo Jing had met with danger, he did not know that the people who rescued Mo Jing were Ling Xiao and You XiaoMo.

source: 玄盛被说服了，他们出来的时间不能太长，否则族人会怀疑，所以这件事必须速战速决，玄泽的战斗力不必玄明差，等他打败那个少年，正好可以来帮他。
en_us: Xuan Sheng was convinced. They could not be away for too long, otherwise their clan members would become suspicious, so this matter must be resolved quickly. Xuan Ze's fighting strength was not any lower than Xuan Ming's. When he defeated that young man, he could go over to help him.
